# Apply

In [12]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame(
    {
        "groups":["A","B","C","A","B","C"],
        "var1" : [10,23,33,22,11,99],
        "var2" : [100,253,333,262,111,23],
    },
    columns = ["groups","var1","var2"]
)
df1

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99    23

In [13]:
import pandas as pd
import numpy as np
df2 = pd.DataFrame(
    {
        "var1" : [10,23,33,22,11,99],
        "var2" : [100,253,333,262,111,23],
    },
    columns = ["var1","var2"]
)
df2

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99    23

In [14]:
df2.apply("sum")

var1     198
var2    1082
dtype: int64

In [15]:
df2.apply(np.sum)

var1     198
var2    1082
dtype: int64

In [16]:
df2.apply(np.mean)

var1     33.000000
var2    180.333333
dtype: float64

In [17]:
df1.groupby("groups").apply(np.sum)

       groups  var1  var2
groups
A          AA    32   362
B          BB    34   364
C          CC   132   356